
/*
Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/
/*
Console.WriteLine("введите первое число ");
int firstNumber = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("введите второе число ");
int secondNumber = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("введите третье число ");
int thirdNumber = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("максимальное число");
int maxNumber = 1;

if(firstNumber > secondNumber && firstNumber > thirdNumber)

firstNumber = maxNumber;

Console.WriteLine("максимальное число" + maxNumber);

if(secondNumber > firstNumber && secondNumber > thirdNumber)

secondNumber = maxNumber;

Console.WriteLine("максимальное число" + maxNumber );

if(thirdNumber > firstNumber && thirdNumber > secondNumber) 

thirdNumber = maxNumber; 

Console.WriteLine("максимальное число" + maxNumber );

*/